import React from "react";

export function Privacy() {
  return (
    <div>
      <p>
        Құпиялылық саясаты Құпиялылық саясаты сайтты пайдаланған кезде дербес
        және өзге де деректерді жинау, өңдеу және пайдалану тәртібін реттейді
        Reis.kz. Біз сіздің деректеріңізді сайтпен жұмыс істеу мүмкіндігін беру
        үшін пайдаланамыз. Сайтты пайдалану және ол арқылы жеке ақпарат беру
        арқылы сіз осы Құпиялылық саясатының шарттарымен келісетіндігіңізді
        растайсыз. Сіз ақпаратты сол мақсаттарда және Құпиялылық саясатында
        сипатталғандай жинауға және пайдалануға келісесіз. Ақпаратты жинау және
        пайдалану Біз сізге сайттың жұмыс істеуін қамтамасыз ету үшін әртүрлі
        мақсаттар үшін бірнеше түрлі деректер түрлерін жинаймыз. Жиналатын
        деректер түрлері Дербес деректер Біздің сайтты пайдалана отырып, біз
        сізден сізбен байланысу немесе сізді анықтау үшін ("жеке деректер")
        пайдалануға болатын белгілі бір жеке ақпаратты беруіңізді сұрай аламыз.
        Бұл ақпарат қамтуы мүмкін, бірақ олармен шектелмейді: Электрондық пошта
        мекенжайы Аты - жөні Cookie файлдары және пайдалану деректері Сайтты
        пайдалану туралы мәліметтер Біз сондай-ақ сайтты қалай пайдаланатыныңыз
        туралы ақпаратты жинай аламыз ("пайдалану деректері"). Бұл деректер
        сіздің IP мекенжайыңыз, шолғыш түрі, шолғыш нұсқасы, сайтқа кірген күн
        мен уақыт, сайтқа кірген беттер, сол беттерде өткізген уақыт, сіз кірген
        бірегей құрылғы идентификаторлары және басқа диагностикалық деректер
        сияқты ақпаратты қамтуы мүмкін. Бақылау және cookie файлдары Біз
        сайттағы әрекеттерді бақылау және белгілі бір ақпаратты сақтау үшін
        cookie файлдары мен ұқсас технологияларды қолданамыз. Cookie
        файлдары-анонимді бірегей идентификаторды қамтуы мүмкін деректері аз
        файлдар. Cookie файлдары сайт арқылы браузерге жіберіледі және құрылғыда
        сақталады. Бақылау технологияларына сонымен қатар ақпарат жинауға,
        сондай-ақ біздің сайтты жақсартуға және талдауға арналған файл маяктары,
        тегтер мен сценарийлер кіреді. Браузерде cookie файлдарын пайдалануды
        өшіруге болады, бірақ бұл жағдайда сайттың кейбір мүмкіндіктерін
        пайдалана алмайсыз. Біз қолданатын cookie файлдарының мысалдары: Сеанс
        cookie файлдары. Біз оларды сайттың жұмысын қамтамасыз ету үшін
        қолданамыз. Параметрлерге арналған Cookie файлдары. Біз сіздің әртүрлі
        параметрлеріңізді есте сақтау үшін осындай cookie файлдарын қолданамыз.
        Security Cookie. Қауіпсіздік мақсаттарын қамтамасыз ету үшін
        қолданылады. Деректерді пайдалану Сайт жиналған деректерді әртүрлі
        мақсаттарда пайдаланады: Қызмет көрсету және сайттың жұмыс істеуін
        қамтамасыз ету Сайттағы өзгерістер туралы Сізге хабарлау Сайттың
        интерактивті мүмкіндіктеріне қатысуға мүмкіндік беру үшін
        Пайдаланушыларға қызмет көрсету және қолдау көрсету үшін Сайттың жұмысын
        талдау және жақсарту Сайтты пайдалану мониторингі Техникалық ақауларды
        анықтау, алдын алу және жою үшін Деректерді беру Сіздің ақпаратыңыз,
        соның ішінде жеке деректер, сіздің юрисдикцияңыздың заңдарынан өзгеше
        болуы мүмкін деректерді қорғау туралы Заңдары бар мемлекеттің
        юрисдикциясынан тыс орналасқан компьютерлерге берілуі мүмкін. Сіздің
        ақпаратыңыз, соның ішінде жеке деректер, сіздің юрисдикцияңыздың
        заңдарынан өзгеше болуы мүмкін деректерді қорғау туралы Заңдары бар
        мемлекеттің юрисдикциясынан тыс орналасқан компьютерлерге берілуі
        мүмкін. Егер сіз Қазақстаннан тыс жерде болсаңыз және бізге ақпарат
        бергіңіз келсе, біз деректерді, оның ішінде жеке деректерді Қазақстанға
        беріп, сол жерде өңдейтінімізді ескеріңіз. Сіздің осы Құпиялылық
        саясатымен келісіміңіз, содан кейін осындай ақпаратты ұсынуыңыз осы
        таратуға келісіміңізді білдіреді. Біз үшінші тарап сайттарының немесе
        қызметтерінің мазмұнын, құпиялылық саясатын немесе әрекеттерін
        бақыламаймыз немесе жауап бермейміз. Құпиялылық саясатына өзгерістер Біз
        Құпиялылық саясатымызды мезгіл-мезгіл жаңарта аламыз. Кез келген
        өзгерістер үшін осы құпиялылық саясатын мезгіл-мезгіл қарап шығуды
        ұсынамыз. Бұл құпиялылық саясатындағы өзгерістер осы бетте жарияланған
        кезде қолданылады. Кері байланыс Егер сізде осы Құпиялылық саясатына
        қатысты сұрақтарыңыз болса, бізбен кері байланыс формасы арқылы
        байланыса аласыз.
      </p>
    </div>
  );
}
